# LossFactor Class (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
LossFactor Class
Members See Also
---
This class is the base class for calculating lighting loss factor.
**Namespace:** Autodesk.Revit.DB.Lighting**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2013
# Syntax
C#
---
```text
public class LossFactor : IDisposable
```

Visual Basic
---
```text
Public Class LossFactor _
	Implements IDisposable
```

Visual C++
---
```text
public ref class LossFactor : IDisposable
```

# Inheritance Hierarchy
System..::..Object Autodesk.Revit.DB.Lighting..::..LossFactor Autodesk.Revit.DB.Lighting..::..AdvancedLossFactor Autodesk.Revit.DB.Lighting..::..BasicLossFactor
# See Also
LossFactor Members
Autodesk.Revit.DB.Lighting Namespace